{
  "Forced bulbs" : {
    "Crocus" : {
      "description" : "The cup-shaped, solitary, salverform flower tapers off into a narrow tube. Their colors vary enormously, although lilac, mauve, yellow, and white are predominant. The grass-like, ensiform leaf[10] shows generally a white central stripe along the leaf axis. The leaf margin is entire.A crocus has three stamens, while a similar-looking toxic plant, Colchicum, sometimes popularly referred to as \"autumn crocus\", has six stamens. In addition, crocus have one style, while Colchicum have three.[11]"
    },
    "Hyacinthus" : {
      "description" : "Hyacinthus grows from bulbs, each producing around four to six linear leaves and one to three spikes or racemes of flowers. In the wild species, the flowers are widely spaced with as few as two per raceme in H. litwinovii and typically six to eight in H. orientalis which grows to a height of 15–20 cm (6–8 in). Cultivars of H. orientalis have much denser flower spikes and are generally more robust.[5]"
    },
    "Narcissus" : {
      "description" : "Vegetative Narcissus bulb with shoot and roots Narcissus shoots emerging, with sheathed leavesNarcissus floral morphology Solitary Narcissus flower, prior to opening, emerging from spathe N. papyraceus, showing umbel formation N. pseudonarcissus showing from top to bottom, spathe, floral tube, tepals, corona N. cyclamineus, showing reflexed tepals N. bulbocodium showing prominent corona and reduced tepals N. triandrus, showing pendent orientation and reflexed tepals Narcissus flower, showing erect orientation Narcissus flower, showing outer white tepals with a central yellow corona (paraperigonium) Tazetta cultivar, showing stamens surrounding central stigma Close-up of stamen filaments and anthers, with stigmaGynoecium and fruit Longitudinal section of ovary with ovules Cross section of ovary Narcissus capsule dispersing seed"
    }
  },
  "Tropical and subtropical" : {
    "Sinningia speciosa" : {
      "description" : "Sinningia speciosa, sometimes known in the horticultural trade as gloxinia, is a tuberous member of the flowering plant native to Brazil within the family Gesneriaceae. Originally included in the genus Gloxinia in 1817, it was reclassified to Sinningia. Showy S. speciosa hybrids are still sometimes referred to simply as \"gloxinia\", although this name is now technically incorrect.[2]The name florist's gloxinia is now sometimes used to distinguish it from the rhizomatous species now included in the genus Gloxinia. Another common name is Brazilian gloxinia.[3] The plants produce large, velvety, brightly colored flowers and are popular houseplants. Cultural requirements are similar to those of African violets except that S. speciosa generally requires more light and often has a dormant period, when the tuber should be kept cool and dry until it resprouts."
    },
    "Tradescantia zebrina" : {
      "description" : "The plant matting on the groundTradescantia zebrina has attractive zebra-patterned leaves, the upper surface showing purple new growth and green older growth parallel to the central axis, as well as two broad silver-colored stripes on the outer edges, with the lower leaf surface presenting a deep uniform magenta. The leaves are bluish green and usually have two longitudinal stripes that are silvery on the surface and purple on the underside. The leaf sheaths are thin and translucent, 8 to 12 mm long and 5 to 8 mm wide, at the mouth they are long, otherwise glabrous or slightly hairy.The low-lying, slightly succulent, perennial, herbaceous plant often forms dense mats or colonies. This is done primarily by natural formation of sinkers. On the nodules of the shoot are root approaches, from which roots develop in permanent contact with water or a sufficiently moist substrate under favorable conditions within a day. The shoots are glabrous or hairy. The stalked, parallel-veined leaves are mostly ovate, 4 to 10 cm long and 1.5 to 3 cm wide, pointed towards the tip, rounded to the base. The upper surface is glabrous to mildly hairy, the underside hairless to averagely hairy, ciliate towards the leaf base. The structure of the flower - usually from the three pink petals and the white sexual organs - is similar to that of the other Tradescantia, but unlike what happens in those, the plant branches off thanks to new buds whose attachment starts below that of the leaf (and not above)The flowers are in groups, supported by two large foliage-like, narrow, ciliate bracts. The hermaphrodite, radial-symmetrical flowers are threefold. The three overgrown sepals are 2 to 3 mm long. The three only grown at the base petals are ovate-blunt, pink to purple and 5 to 9 mm long. The six equally sized stamens are violet hairy. Three carpels have become a top permanent ovary grown. They form capsule fruits that contain gray-brown seeds.[3]"
    },
    "Spathiphyllum" : {
      "description" : "Spathiphyllum is a genus of about 47 species of monocotyledonous flowering plants in the family Araceae, native to tropical regions of the Americas and southeastern Asia. Certain species of Spathiphyllum are commonly known as spath or peace lilies.They are evergreen herbaceous perennial plants with large leaves 12–65 cm long and 3–25 cm broad. The flowers are produced in a spadix, surrounded by a 10–30 cm long, white, yellowish, or greenish spathe. The plant does not need large amounts of light or water to survive.Contents 1 Etymology 2 Selected species 3 Cultivation and uses 4 Toxicity 5 See also 6 References 7 External links"
    },
    "Asparagus aethiopicus" : {
      "description" : "The species was originally described by Carl Linnaeus in 1767. The attribution \"Sprenger's Asparagus,\" refers to Carl Ludwig Sprenger who made it popular in Europe as an ornamental plant.Asparagus aethiopicus is a branching perennial herb with tough green aerial stems which are sparsely covered with spines. The oval-shaped leaves are actually leaf-like cladodes, which are 0.8–2 cm long and 0.1-0.2 cm wide, and arise in groups of four or more from the stem. Occurring in spring, the small white or pinkish-white flowers are 0.3-0.5 cm long and arise in clusters off the stem. Flowers are followed in summer by small round berries 0.5 cm in diameter, which bear a black 3 mm diameter seed. Initially green, the berries mature and turn red in the winter. The root system is a mat of fibrous roots with bulbous tubers, from which plants may resprout.[6][7]Flowers Fruit Thorns"
    },
    "Ficus benjamina" : {
      "description" : "Ficus benjamina is a tree reaching 30 m (98 feet) tall in natural conditions, with gracefully drooping branchlets and glossy leaves 6–13 cm (2 3⁄8–5 1⁄8 inches), oval with an acuminate tip. The bark is light gray and smooth. The bark of young branches is brownish. The widely spread, highly branching tree top often covers a diameter of 10 meters. It is a relatively small-leaved fig. The changeable leaves are simple, entire and stalked. The petiole is 1 to 2.5 cm (3⁄8 to 1 inch) long. The young foliage is light green and slightly wavy, the older leaves are green and smooth; the leaf blade is ovate to ovate-lanceolate with wedge-shaped to broadly rounded base and ends with a short dropper tip. The pale glossy to dull leaf blade is 5 to 12 cm (2 to 4 1⁄2 inches) cm long and 2 to 6 cm (1 to 2 1⁄2 inches) wide. Near the leaf margins are yellow crystal cells (\"cystolites\"). The two membranous, deciduous stipules are not fused, lanceolate and 6 to 12 mm (1⁄4 to 1⁄2 inch) (rarely to 15 mm or 9⁄16 inch) long.[7]F. benjamina is monoecious. The inflorescences are spherical to egg-shaped, shiny green, and have a diameter of 1.5 cm (1⁄2 inch). In the inflorescences are three types of flowers: male and fertile and sterile female flowers. The scattered, inflorescences, stalked, male flowers have free sepals and a stamen. Many fertile female flowers are sessile and have three or four sepals and an egg-shaped ovary. The more or less lateral style ends in an enlarged scar.The ripe figs (collective fruit) are orange-red and have a diameter of 2.0 to 2.5 cm (3⁄4 to 1 inch)."
    },
    "Aphelandra squarrosa" : {
      "description" : "This plant flourishes in abundant, but not direct, light. It does not bloom often, but it can be encouraged to bloom by prolonged daily exposure to light. It is also very sensitive to moisture content; too much or too little water will cause the lower leaves to brown and fall off. It likes to be kept moist, but not wet. On average, it needs frequent, small amounts of water, as opposed to an occasional, thorough watering.The plant flourishes when the temperature is in the range of 18-21 °C (65-70 °F); and will suffer if the temperature drops below 15 °C (60 °F) for prolonged periods."
    },
    "Pilea peperomioides" : {
      "description" : "Having a superficial resemblance to pennyworts and growing 30 cm (12 in) tall and wide, it is an erect, evergreen perennial, with round, dark green, peltate leaves up to 10 cm (4 in) in diameter on a long petiole.[3] The stem axis is greenish to dark brown, usually simple, often upright straight, slightly lignified at the base. In poor growing conditions, the plants lose their leaves in the lower part of the branch axis and thereby assume a very distinctive habit. The plants are completely hairless. Striking are their large, circular, shiny, leaves, which can have a diameter of over 15 centimeters (6 in). The petioles are wild growing 5 cm to 45 cm (2 to 17 in) long, in indoor plants up to 30 centimeters (12 in). The flowers are inconspicuous.[4]"
    },
    "Dracaena" : {
      "description" : "Species of Dracaena have a secondary thickening meristem in their trunk, termed Dracaenoid thickening by some authors,[citation needed] which is quite different from the thickening meristem found in dicotyledonous plants. This characteristic is shared with members of the Agavoideae and Xanthorrhoeoideae among other members of the Asparagales.Dracaena species can be classified in two growth types: treelike dracaenas (Dracaena fragrans, Dracaena draco, Dracaena cinnabari), which have aboveground stems with a single cluster of leaves at the end of each stem and rhizomatous dracaenas (Dracaena trifasciata, Dracaena angolensis), which have underground rhizomes and leaves on the surface (ranging from straplike and moderately thin to thick and cylindrical).[citation needed]Many species of Dracaena are kept as houseplants due to tolerance of lower light and sparse watering.[citation needed]Dracaena cinnabari Dracaena draco Dracaena ellenbeckiana Dracaena fragrans Dracaena reflexa Dracaena sanderiana Dracaena surculosa Dracaena tamaranae - native to Gran Canaria Dracaena trifasciata"
    },
    "Scindapsus pictus" : {
      "description" : "Growing to 3 m (10 ft) tall in open ground, it is an evergreen climber. They are matte green and covered in silver blotches. The insignificant flowers are rarely seen in cultivation.The specific epithet pictus means \"painted\", referring to the variegation on the leaves.[3]With a minimum temperature tolerance of 15 °C (59 °F), this plant is cultivated as a houseplant in temperate regions, where it typically grows to 90 cm (35 in).[4] The cultivar 'Argyraeus' has gained the Royal Horticultural Society's Award of Garden Merit.[5][6]"
    },
    "Alocasia" : {
      "description" : "The large cordate or sagittate leaves grow to a length of 20 to 90 cm on long petioles. Their araceous flowers grow at the end of a short stalk, but are not conspicuous; often hidden behind the leaf petioles.The corms of some species can be processed to make them edible, but the raw plants contain raphid or raphide crystals of calcium oxalate along with other irritants (possibly including proteases)[3] that can numb and swell the tongue and pharynx; they cause difficulty in breathing, and sharp pain in the throat. The lower parts of the plant contain the highest concentrations of the poison. Prolonged boiling before serving or processing may reduce the risks, and acidic fruit such as tamarind may dissolve the raphides. However the species vary in toxicity, and it is dangerous to experiment with the edibility of any Alocasia."
    },
    "Maranta" : {
      "description" : "Maranta is a genus of flowering plants in the family Marantaceae, native to tropical Central and South America and the West Indies.[2][3] Maranta was named for Bartolomeo Maranta, an Italian physician and botanist of the sixteenth century.About 40-50 species are currently recognized.[1] They all have rhizomes and naturally form perennial clumps. The crowded oval, evergreen leaves are undivided with sheathing stalks. The leaves are flat by day and folded up as the day comes to an end, hence the common name \"prayer plant\" which attaches to the genus and its species - notably M. leuconeura.[4] The flowers are small with three petals and two larger petal-like staminodes.Contents 1 Cultivation 2 Species 3 References 4 External links"
    },
    "Bromeliaceae" : {
      "description" : "BromeliadBromeliads are plants that are adapted to various climates. Foliage takes different shapes, from needle-thin to broad and flat, symmetrical to irregular, spiky to soft. The foliage, which usually grows in a rosette, is widely patterned and colored. Leaf colors range from maroon, through shades of green, to gold. Varieties may have leaves with red, yellow, white and cream variations. Others may be spotted with purple, red, or cream, while others have different colors on the tops and botttoms, and species Tillandsia cyanea have a fragrance resembling that of clove spice.One study found 175,000 bromeliads per hectare (2.5 acres) in one forest; that many bromeliads can sequester 50,000 liters (more than 13,000 gallons) of water.[8]Various organisms take advantage of the pools of water trapped by bromeliads. A study of 209 plants from the Ecuadorian lowlands identified 11,219 animals, representing more than 300 distinct species, many of which are found only on bromeliads. Examples include some species of ostracods, small salamanders about 2.5 cm (1 in) in length, and tree frogs. Jamaican bromeliads are home to Metopaulias depressus, a reddish-brown crab 2 cm (0.8 in) across, which has evolved social behavior to protect its young from predation by Diceratobasis macrogaster, a species of damselfly whose larvae live in bromeliads. Some bromeliads even form homes for other species of bromeliads.[8]"
    },
    "Chlorophytum comosum" : {
      "description" : "Chlorophytum comosum grows to about 60 cm (24 in) tall. It has fleshy, tuberous roots, each about 5–10 cm (2–4 in) long. The long narrow leaves reach a length of 20–45 cm (8–18 in) and are around 6–25 millimetres (0.2–1.0 in) wide.[6]Flower of Chlorophytum comosum 'Vittatum'Flowers are produced in a long, branched inflorescence, which can reach a length of up to 75 cm (30 in) and eventually bends downwards to meet the earth. Flowers initially occur in clusters of 1–6 at intervals along the stem (scape) of the inflorescence. Each cluster is at the base of a bract, which ranges from 2–8 cm (0.8–3.1 in) in length, becoming smaller towards the end of the inflorescence. Most of the flowers which are produced initially die off, so that the inflorescences are relatively sparsely flowered.[6]Individual flowers are greenish-white, borne on stalks (pedicels) some 4–8 mm (0.2–0.3 in) long. Each flower has six triply veined tepals which are 6–9 mm (0.2–0.4 in) long and slightly hooded or boat-shaped at their tips. The stamens consist of a pollen-producing anther about 3.5 mm (0.1 in) long with a filament of similar length or slightly longer. The central style is 3–8 mm (0.1–0.3 in) long. Seeds are produced in a capsule, 3–8 mm (0.1–0.3 in) long, on stalks (pedicels) which lengthen to up to 12 mm (0.5 in).[6]The inflorescences carry plantlets at the tips of their branches, which eventually droop and touch the soil, developing adventitious roots. The stems (scapes) of the inflorescence are called \"stolons\" in some sources, but this term is more correctly used for stems which do not bear flowers and have roots at the nodes.[7]"
    },
    "Schefflera arboricola" : {
      "description" : "FlowersIt is an evergreen shrub growing to 8–9 m tall, free-standing, or clinging to the trunks of other trees as an epiphyte. The leaves are palmately compound, with 7–9 leaflets, the leaflets 9–20 cm long and 4–10 cm broad (though often smaller in cultivation) with a wedge-shaped base, entire margin, and an obtuse or acute apex, sometimes emarginate.[1][2] The leaves are leathery in texture, shiny green glabrous on the upper surface and somewhat lighter and matte on the underside. Young plants have smaller leaves and fewer leaflets. Each leaflet has a central rib that divides it into two halves, with between four and six ribs clearly visible up to the third order. The stipules merge with the petiole, the length of which is 12-15 cm.[3]The flowers are produced in a 20 cm panicle of small umbels, each umbel 7–10 mm diameter with 5–10 flowers.[1] The flowering period extends from midsummer to early autumn. The flowers are hermaphroditic, having a colour ranging from yellow to green and a double perianth radial symmetry. They are composed of an entire annular calyx, five almost fully developed sepals, a corolla with five petals 2.5 mm long, with five stamens and five or six carpels that enclose the ovary. The style is not recognizable and the stigma is established.[2] The fruits have an almost spherical oval drupe, with a diameter of about 5 mm. Inside the endocarp contains five seeds. These fruits ripen from late summer to early winter and are initially glandular points of a colour that ranges from orange to red-violet at maturity."
    },
    "Orchidaceae Cymbidium Dendrobium Miltoniopsis Oncidium Paphiopedilum Phalaenopsis" : {
      "description" : "High resolution image of an orchidOrchids are easily distinguished from other plants, as they share some very evident derived characteristics or synapomorphies. Among these are: bilateral symmetry of the flower (zygomorphism), many resupinate flowers, a nearly always highly modified petal (labellum), fused stamens and carpels, and extremely small seeds."
    },
    "Anthurium" : {
      "description" : "Anthurium is a genus of herbs often growing as epiphytes on other plants. Some are terrestrial. The leaves are often clustered and are variable in shape. The inflorescence bears small flowers which are perfect, containing male and female structures. The flowers are contained in dense spirals on the spadix. The spadix is often elongated into a spike shape, but it can be globe-shaped or club-shaped. Beneath the spadix is the spathe, a type of bract. This is variable in shape, as well, but it is lance-shaped in many species. It may extend out flat or in a curve. Sometimes it covers the spadix like a hood. The fruits develop from the flowers on the spadix. They are juicy berries varying in color, usually containing two seeds.[10]The spadix and spathe are a main focus of Anthurium breeders, who develop cultivars in bright colors and unique shapes. Anthurium scherzerianum and A. andraeanum, two of the most common taxa in cultivation, are the only species that grow bright red spathes. They have also been bred to produce spathes in many other colors and patterns.[11]Anthurium plants are poisonous due to calcium oxalate crystals. The sap is irritating to the skin and eyes.[5]"
    },
    "Philodendron species" : {
      "description" : ""
    },
    "Dieffenbachia" : {
      "description" : "Dieffenbachia \/ˌdiːfɪnˈbækiə\/[2] is a genus of tropical flowering plants in the family Araceae. It is native to the New World Tropics from Mexico and the West Indies south to Argentina. Some species are widely cultivated as ornamental plants, especially as houseplants, and have become naturalized on a few tropical islands.[1][3][4]Dieffenbachia is a perennial herbaceous plant with straight stem, simple and alternate leaves containing white spots and flecks, making it attractive as indoor foliage. Species in this genus are popular as houseplants because of their tolerance of shade. Its English names, dumb cane and mother-in-law's tongue (also used for Sansevieria species) refer to the poisoning effect of raphides, which can cause temporary inability to speak.[5] Dieffenbachia was named by Heinrich Wilhelm Schott, director of the Botanical Gardens in Vienna, to honor his head gardener Joseph Dieffenbach (1796–1863).Inflorescence of Dieffenbachia oerstediiCross section and radial section of stemContents 1 Species 2 Ecology 3 Cultivation 4 Toxicity 5 References 6 Sources 7 External links"
    },
    "Hoya species" : {
      "description" : "Hoya carnosaHoyas are evergreen perennial creepers or vines or rarely, shrubs. They often grow epiphytically on trees; some grow terrestrially, or occasionally in rocky areas. They climb by twining, and with the employment of adventitious roots. Larger species grow 1–18 m (3–59 ft), or more, with suitable support in trees. They have simple entire leaves, arranged in an opposite pattern, that are typically succulent. Leaves may exhibit a variety of forms, and may be smooth, felted or hairy; venation may be prominent or not, and many species have leaf surfaces flecked with irregular small silvery spots.The flowers appear in axillary umbellate clusters at the tip of peduncles. Hoya peduncles are commonly referred to as spurs. In most species these spurs are perennial and are rarely shed. Each flowering cycle increases the length of the spur, and in the larger species can eventually reach 27 cm (11 in) or more. Flowers vary in size from 3 mm (0.1 in) (Hoya bilobata Schltr.) to over 95 mm (4 in) (in H. lauterbachii K. Schuman) in diameter. Flower form is typically star-shaped, with five thick, waxy, triangular petals, topped with another star-shaped structure, the corona. Colours on most species range from white to pink; there are species that exhibit yellow to orange, dark reds to near-black, and there are green flowers. Many are sweetly scented. and most produce abundant nectar.Pollinators include moths, flies, and ants. Pollination is poorly understood, but plants left outdoors in temperate regions do sometimes produce seed, indicating pollination by local insects.Seeds are borne in twin pods, actually follicles, are generally light, and are dispersed by the wind by means of a small tuft of silky fluff. Germination is rapid, but viability is not long.At least some species exhibit Crassulacean Acid Metabolism (CAM), including H. carnosa.Several species exhibit adaptations for mutualism with ants by providing modified leaves for domatia (\"homes\"), much as in the related genus Dischidia; H. imbricata has leaves that form a concave cup over the tree trunk it climbs up to shelter ants, and H. darwinii has arrangements of bullate leaves on its stems to form shelters."
    },
    "Calathea" : {
      "description" : ""
    },
    "Monstera" : {
      "description" : "They are herbs or evergreen vines, growing to heights of 20 metres (66 ft) in trees, climbing by means of aerial roots which act as hooks over branches; these roots will also grow into the soil to help support the plant. Since the plant roots both into the soil and over trees, it is considered a hemiepiphyte.[4] The leaves are alternate, leathery, dark green, very large, from 25–90 centimetres (9.8–35.4 in) long (up to 130 centimetres (51 in) long in M. dubia) and 15–75 centimetres (5.9–29.5 in) broad, often with holes in the leaf blade. The flowers are borne on a specialised inflorescence called a spadix, 5–45 centimetres (2.0–17.7 in) long; the fruit is a cluster of white berries, edible in some species.Large Monstera deliciosaThey are commonly grown indoors as houseplants. The best-known representative of the genus, Monstera deliciosa, is also cultivated for its edible fruit which tastes like a combination of banana and pineapple."
    },
    "Araucaria heterophylla" : {
      "description" : "Profile representation of an adult Araucaria heterophylla with its root system, Auckland-New Zealand, survey and hand drawing by Axel Aucouturier, 2019It is a slow growing tree, reaching a height of 50–65 m (160–210 ft), with straight vertical trunks and symmetrical branches, even in the face of incessant onshore winds that can contort most other species. From the straight trunk, it emits its branches almost horizontal or slightly oblique, in number of five, forming floors; the plane of each floor is a perfect pentagon. If kept indoors, the tree remains smaller. The gray-brown bark falls off in fine scales. At the more or less horizontal to sometimes hanging branches, the branches are four to seven in regular whorls.The young leaves are soft and awl-shaped, 1–1.5 cm (3⁄8–9⁄16 in) long, about 1 mm (1⁄32 in) thick at the base on young trees, and incurved, 5–10 mm (3⁄16–13⁄32 in) long and variably 2–4 mm (3⁄32–5⁄32 in) broad on older trees. The thickest, scale-like leaves on coning branches are in the upper crown. The cones are squat globose, 10–12 cm (4–5 in) long and 12–14 cm (5–6 in) diameter, and take about 18 months to mature. They disintegrate at maturity to release the nut-like edible seeds. The seeds have a length of 2.5 to 3 cm (1 to 1 1⁄8 in) and a diameter of about 1.2 cm (1⁄2 in) with wide wings. There are four cotyledons present. It is a dioecious tree (male and female flowers in different plants), although it can also be monoecious.The scientific name heterophylla (\"different leaves\") derives from the variation in the leaves between young and adult plants."
    },
    "Ficus elastica" : {
      "description" : "It is a large tree in the banyan group of figs, growing to 30–40 metres (98–131 ft) (rarely up to 60 metres or 200 feet) tall, with a stout trunk up to 2 metres (6.6 ft) in diameter. The trunk develops aerial and buttressing roots to anchor it in the soil and help support heavy branches.It has broad shiny oval leaves 10–35 centimetres (3.9–13.8 in) long and 5–15 centimetres (2.0–5.9 in) broad; leaf size is largest on young plants (occasionally to 45 centimetres or 18 inches long), much smaller on old trees (typically 10 centimetres or 3.9 inches long). The leaves develop inside a sheath at the apical meristem, which grows larger as the new leaf develops. When it is mature, it unfurls and the sheath drops off the plant. Inside the new leaf, another immature leaf is waiting to develop."
    },
    "Mimosa pudica" : {
      "description" : "Mimosa pudica flower from Thrissur, Kerala, IndiaFlowerMimosa pudica folding leaflets inward.Mimosa pudica seedsMimosa pudica with mature seed pods on plantMimosa pudica seedling with two cotyledons and some leaflets.The whole plant of Mimosa pudica includes thorny stem and branches, flower head, dry flowers, seed pods, and folded and unfolded leafletsThe stem is erect in young plants, but becomes creeping or trailing with age. It can hang very low and become floppy. The stem is slender, branching, and sparsely to densely prickly, growing to a length of 1.5 m (5 ft).The leaves are bipinnately compound, with one or two pinnae pairs, and 10–26 leaflets per pinna. The petioles are also prickly. Pedunculate (stalked) pale pink or purple flower heads arise from the leaf axils in mid summer with more and more flowers as the plant gets older. The globose to ovoid heads are 8–10 mm (0.3–0.4 in) in diameter (excluding the stamens). On close examination, it is seen that the floret petals are red in their upper part and the filaments are pink to lavender. Pollens are circular with approximately 8 microns diameter.PollensThe fruit consists of clusters of two to eight pods from 1–2 cm (0.4–0.8 in) long each, these being prickly on the margins. The pods break into two to five segments and contain pale brown seeds about 2.5 mm (0.1 in) long. The flowers are insect pollinated and wind pollinated.[9] The seeds have hard seed coats which restrict germination and make osmotic pressure and soil acidity less significant hindrances. High temperatures are the main stimuli that cause the seeds to end dormancy.[10]The roots of Mimosa pudica create carbon disulfide, which prevents certain pathogenic and mycorrhizal fungi from growing within the plant's rhizosphere.[11] This allows the formation of nodules on the roots of the plant that contain endosymbiotic diazotrophs, which fix atmospheric nitrogen and convert it into a form that is usable by the plant.[12]Mimosa pudica is a tetraploid (2n = 52).[13]"
    },
    "Aspidistra elatior" : {
      "description" : "Growing to 60 cm (24 in) tall and wide, it is an evergreen rhizomatous perennial, with glossy dark green leaves 30–50 cm (12–20 in) long, and fleshy, 8-lobed cream flowers with maroon colouring on the inner surface, borne in early summer.[5]"
    },
    "Ficus lyrata" : {
      "description" : "An indoor fiddle leaf fig treeFicus lyrata, commonly known as the fiddle-leaf fig, is a species of flowering plant in the mulberry and fig family Moraceae. It is native to western Africa, from Cameroon west to Sierra Leone, where it grows in lowland tropical rainforest. It can grow up to 12–15 m (39–49 ft) tall.Above: an example of a lyrate leaf. Ficus lyrata leaves are lyrate, meaning that they resemble a lyre.The leaves are variable in shape, but often with a broad apex and narrow middle, resembling a lyre or fiddle; they are up to 45 cm (18 in) long and 30 cm (12 in) broad, though usually smaller, with a leathery texture, prominent veins and a wavy margin.The fruit is a green fig 2.5–3 cm (1-¼ in) diameter.Contents 1 Cultivation and garden uses 2 Indoor use 3 See also 4 References 5 External links"
    },
    "Citrus, compact cultivars such as the Meyer lemon" : {
      "description" : "Slices of various citrus fruits"
    },
    "Peperomia species" : {
      "description" : "Though varying considerably in appearance (see gallery below), these species generally have thick, stout stems and fleshy leaves, sometimes with epidermal windows. Peperomia flowers typically come in yellow to brown conical spikes.These tropical perennials are grown for their ornamental foliage. They are mostly natives of tropical America. They are compact and usually do not exceed 12 inches (30 cm) in height. They vary considerably in appearance. Some have threadlike, trailing stems and some have fleshy, stout stems. The leaves are smooth and fleshy and may be oval with the leafstalk at or near the center of the leaf blade, or they may be heart-shaped or lance-shaped; their size may vary from 1–4 inches (2.5–10.2 cm) long. They may be green or striped, marbled or bordered with pale green, red or gray, and the petioles of some kinds are red. The tiny flowers are unnoticeable and they grow in the form of cordlike spikes. The fruit is a berry that eventually dries out and shows the pepper-like seed."
    },
    "Streptocarpus, including Streptocarpus sect. Saintpaulia" : {
      "description" : "Within the Streptocarpus subgenus Streptocarpus, there are two main forms, the plurifoliates and the unifoliates.Streptocarpus with more than one leaf are called \"plurifoliates\", and there are two main types of these. First is the rosulate form, which is perennial. Rosulates are made up of a basal rosette of leaves. Flower stems sprout from the upper surfaces of the bases of these leaves. The most common Streptocarpus houseplant is of the rosulate type. The flowers of modern rosulate hybrids are generally three to several centimeters in diameter. The other plurifoliate type is essentially somewhere in between a rosulate and a unifoliate. In this group, two or three leaves grow in addition to the first leaf. The plurifoliates are perennial. Examples are Streptocarpus prolixus, and Streptocarpus polyanthus ssp polyanthus.[11]StreptocarpellaThe second form is the unifoliate, which only has one leaf. In the unifoliates group, one single leaf grows continuously from the base. Many unifoliates are also monocarpic, which means that they will flower once, set seed, then die. But they may take a few years to reach this stage. In other unifoliates, the original leaf may die, but one or two new leaves will sprout from it, and the plant continues to grow.[8]This subgenus (comprising plurifoliates and unifoliates) is unique in that, in winter, they can form abscission lines part way down the leaf (see photo gallery below). The leaf then dies back to this point, whilst the proximal part of the leaf stays alive and healthy. In unifoliate species, the remaining healthy portion of that leaf will start to grow again from the base.[8]Members of the Streptocarpus subgenus Streptocarpella are very different in form to those mentioned above.The flowers and seed pods are similar, but the leaves and stems are caulescent (have stems). Streptocarpellas are generally clump-forming or trailing plants. Their flowers are only about 2.5-3.5 cm in diameter, and their colour range seems to be limited to mid-purples, pale pinks, and white.Streptocarpella leaves can be decussate in arrangement (each pair of leaves at a node is at 90 degrees to the ones preceding or following it), or ternate (whorls of 3 leaves at each node). Some specimens may exhibit both on the same plant. Streptocarpella are grown as houseplants, hanging plants, and sometimes as bedding plants.These two Streptocarpus subgenera do not interbreed.For information on Streptocarpus subgenus Streptocarpella section Saintpaulia, see the article Streptocarpus sect. Saintpaulia."
    },
    "Sansevieria trifasciata" : {
      "description" : "It is an evergreen perennial plant forming dense stands, spreading by way of its creeping rhizome, which is sometimes above ground, sometimes underground. Its stiff leaves grow vertically from a basal rosette. Mature leaves are dark green with light gray-green cross-banding and usually range from 70–90 centimetres (28–35 in) long and 5–6 centimetres (2.0–2.4 in) wide, though it can reach heights above 2 m (6 ft) in optimal conditions.[citation needed]The specific epithet trifasciata means \"three bundles\".[3]The plant exchanges oxygen and carbon dioxide using the crassulacean acid metabolism process, which allows them to withstand drought. The microscopic pores on the plant's leaves, called the stomata and used to exchange gases, are only opened at night to prevent water from escaping via evaporation in the hot sun. As a result, stored oxygen is released at the opening of the stomata at night, unlike most plants which continuously exchange gases during the day.[citation needed]It is a weed in some parts of northern Australia.[4]"
    },
    "Chamaedorea elegans" : {
      "description" : "A woody, rhizomatous plant with a slender green trunk, it is found in tropical areas and grows to 2–3 m (6 ft 7 in–9 ft 10 in) tall (rarely to 4–5 m (13–16 ft). It has 1.2 cm-long ringed stigma, punctured crescent-shaped leaves, erect buds, and flexible tubular stems without spines with generally pinnate foliage. The crown carries 3-10 long-leaf pinnate leaves (more when mature). A remarkable feature of this species is the early age of the onset of flowering, with some plants blooming with a height of only 30 cm.[10]The small, light yellow, yellow, or orange-red odorous flowers appear on irregularly branched petioles that grow below or among the leaf. They emerge from the trunk as lateral buds and open in the form of clusters of small balls without petals. These have a certain resemblance to those of the mimosa. Occasionally, pea-sized berries develop after flowering, which are 6mm in diameter, and dark, collected in paniculate inflorescences.[11]"
    },
    "Dypsis lutescens" : {
      "description" : "Dypsis lutescens grows 6–12 m (20–39 ft) in height. Multiple stems emerge from the base. The fronds are arched, 2–3 m (6 ft 7 in–9 ft 10 in) long, and pinnate, with 40-60 pairs of leaflets. It bears panicles of yellow flowers in summer. Offsets can be cut off when mature enough, as a propagation method.It is grown as an ornamental plant in gardens in tropical and subtropical regions, and elsewhere indoors as a houseplant. It has gained the Royal Horticultural Society's Award of Garden Merit.[4][5]One of several common names, \"butterfly palm\", refers to the leaves which curve upwards in multiple stems to create a butterfly look.[6]In its introduced range, this plant acts as a supplier of fruit to some bird species which feed on it opportunistically, such as Pitangus sulphuratus, Coereba flaveola and Thraupis sayaca species in Brazil.[7]"
    },
    "Epipremnum aureum" : {
      "description" : "Induced floweringEpipremnum aureum is an evergreen vine growing to 20 m (66 ft) tall, with stems up to 4 cm (2 in) in diameter, climbing by means of aerial roots which adhere to surfaces. The leaves are alternate, heart-shaped, entire on juvenile plants, but irregularly pinnatifid on mature plants, up to 100 cm (39 in) long and 45 cm (18 in) broad; juvenile leaves are much smaller, typically under 20 cm (8 in) long.The flowers are produced in a spathe up to 23 cm (9 in) long. This plant produces trailing stems when it climbs up trees and these take root when they reach the ground and grow along it. The leaves on these trailing stems grow up to 10 cm (4 in) long and are the ones normally seen on this plant when it is cultivated as a potted plant."
    },
    "Cyclamen" : {
      "description" : "Cyclamens have a tuber, from which the leaves, flowers and roots grow. In most species, leaves come up in autumn, grow through the winter, and then die in spring, then the plant goes dormant through the dry Mediterranean summer."
    },
    "Yucca species" : {
      "description" : "Yucca Yucca filamentosa naturalized in New Zealand Scientific classification Kingdom: Plantae Clade: Tracheophytes Clade: Angiosperms Clade: Monocots Order: Asparagales Family: Asparagaceae Subfamily: Agavoideae Genus: Yucca L. Species See text Synonyms Clistoyucca (Engelm.) Trel. Samuela Trel. Sarcoyucca (Engelm.) Linding.[1]Yucca is a genus of perennial shrubs and trees in the family Asparagaceae, subfamily Agavoideae.[2] Its 40–50 species are notable for their rosettes of evergreen, tough, sword-shaped leaves and large terminal panicles of white or whitish flowers. They are native to the hot and dry (arid) parts of the Americas and the Caribbean.Early reports of the species were confused with the cassava (Manihot esculenta).[3] Consequently, Linnaeus mistakenly derived the generic name from the Taíno word for the latter, yuca.[4]Contents 1 Distribution 2 Ecology 3 Adaptations 4 Uses 4.1 Gastronomy 5 Cultivation 6 Symbolism 7 Species 8 Taxonomic arrangement 9 Cultivars 10 Gallery 11 References 12 External links"
    },
    "Begonia species and cultivars" : {
      "description" : "With 1,831 species, Begonia is one of the largest genera of flowering plants.[1][2] The species are terrestrial (sometimes epiphytic) herbs or undershrubs, and occur in subtropical and tropical moist climates, in South and Central America, Africa, and southern Asia. Terrestrial species in the wild are commonly upright-stemmed, rhizomatous, or tuberous. The plants are monoecious, with unisexual male and female flowers occurring separately on the same plant; the male contains numerous stamens, and the female has a large inferior ovary and two to four branched or twisted stigmas. In most species, the fruit is a winged capsule containing numerous minute seeds, although baccate fruits are also known. The leaves, which are often large and variously marked or variegated, are usually asymmetric (unequal-sided).Begonia brevirimosa Begonia aconitifolia A flowering begonia Begonia cultivars come in many different colors, such as yellow A begonia leaf A pair of blossoms, male and female A nautilus-leaf form of begonia Begonia Begonia leaf Cracklin Rosie begonia Cracklin Rosie begonia"
    },
    "Nephrolepis exaltata cv. Bostoniensis" : {
      "description" : "The fronds of Nephrolepis exaltata are 50–250 centimetres (20–98 in) long and 6–15 centimetres (2.4–5.9 in) broad, with alternate pinnae (the small \"leaflets\" on either side of the midrib), each pinna being 2–8 centimetres (0.79–3.15 in) long. The pinnae are generally deltoid, as seen in the adjacent picture. The pinnate vein pattern is also visible on these highly compound leaves. The edges appear slightly serrate. The plant can grow both terrestrially and as an epiphyte, linear to lanceolate and glandular. The rachis bears monochrome sprout soups. The leaflets are entire, undestroyed and oblong-lanceolate up to 4.8 inches (120 mm) long and up to 0.9 inches (23 mm) wide. They stand at a distance of less than 1 centimetre (0.39 in). The sori are rounded. The spores are warty and wrinkled. Nephrolepis exaltata forms an underground rhizome that is slim and tuberous.The species has erect fronds, but Nephrolepis exaltata 'Bostoniensis' (Boston fern) and 'Teddy Junior' have gracefully arching fronds. This mutation was discovered in a shipment of N. exaltata to Boston from Philadelphia in 1894.[2] Other proposals for the origin of the term Boston fern were documented by David Fairchild, who stated that the term came from Florida pioneer nurseryman John Soar, who sent the plants to his friend in Boston.[3]"
    },
    "Stephanotis floribunda" : {
      "description" : "seed podA bride with a Stephanotis bouquetStephanotis floribunda dry pod - seeds with 'parachutes' are still inStephanotis floribunda seed with 'parachute'Stephanotis floribunda syn. S. jasminoides, the Madagascar jasmine, waxflower, Hawaiian wedding flower, or bridal wreath is a species of flowering plant in the family Apocynaceae, native to Madagascar. Growing to 6 m (20 ft) or more, it is an evergreen woody climber with glossy, leathery oval leaves and clusters of pure white, waxy, intensely fragrant tubular flowers.[1]Contents 1 Cultivation 2 Potting 3 Watering 4 Exposure 5 Temperature ranges 6 Flowers 7 Fertilizer 8 Propagation 9 References"
    },
    "Aglaonema" : {
      "description" : "These are evergreen perennial herbs with stems growing erect or decumbent and creeping. Stems that grow along the ground may root at the nodes. There is generally a crown of wide leaf blades which in wild species are often variegated with silver and green coloration. The inflorescence bears unisexual flowers in a spadix, with a short zone of female flowers near the base and a wider zone of male flowers nearer the tip. The fruit is a fleshy berry that ripens red. The fruit is a thin layer covering one large seed.[2]Plants of the genus are native to humid, shady tropical forest habitat.[3]"
    },
    "Hippeastrum" : {
      "description" : "Hippeastrum: Trivalvar CapsuleHippeastrum: Pistil and stamensHippeastrum: Stamens with filaments (white) ending in anthers carrying pollenHippeastrum striatumMost Hippeastrum bulbs are tunicate (a protective dry outer layer and fleshy concentric inner scales or leaf bases). The bulbs are generally between 5–12 cm (2\"–5\") in diameter and produce two to seven long-lasting evergreen or deciduous leaves that are 30–90 cm (12\"–36\") long and 2.5–5 cm (1\"–2\") wide. The leaves are hysteranthous (develop after flowering), sessile (borne directly from the stem or peduncle), rarely persistent and subpetiolate.[19]The flowers are arranged in umbelliform inflorescences which are pauciflor or pluriflor (2-14 flowers), supported on an erect hollow scape (flower stem) which is 20–75 cm (12\"–30\") tall and 2.5–5 cm (1\"–2\") in diameter with two free bracts forming a spathe which is bivalve with free leaflets at its base.[20] Depending on the species, there are two to fifteen large showy flowers, which are more or less zygomophic and hermaphrodite. Each flower is 13–20 cm (5\"–8\") across, and the native species are usually purple or red. They are funnelform (funnel shaped)[21] and declinate (curving downwards and then upwards at the tip)[22] in shape. The perianth has six brightly colored tepals (three outer sepals and three inner petals) that may be similar in appearance or very different. The perianth segments are subequal or unequal.[23] The tepals are united at the base to form a short tube, usually with a rudimentary scaly paraperigonium[24] with fimbriae[25] or a callose ridge present at the throat.The androecium consists of six stamens with filiform (thread like) filaments, which are fasciculate (in close bundles) and declinate or ascendent. The anthers are dorsifixed or versatile.[26] In the gynaecium, the ovary is inferior and trilocular with pluriovulate locules.[27] The style is filiform, and the stigma trifid. The fruit forms a trivalve capsule containing seeds which are dry, flattened, obliquely winged or irregularly discoid, hardly ever turgid, and globose (spherical) or subglobose, with a brown or black phytomelanous testa.[28]"
    }
  },
  "Succulents" : {
    "Senecio rowleyanus" : {
      "description" : "LeavesCurio rowleyanus receives its common name from specialized leaves which are the size and shape of small peas (about ​1⁄4 inch diameter).Its trailing stems can grow 2–3 feet (60–90 cm). There is a small tip at the distal point of each leaf and a thin band of dark green tissue on the side known as a \"window\" (see below). It blooms during the summer and, like all asterids, it has a compound flower. The trumpet shaped flower forms clusters (about ​1⁄2 inch diameter) of small white flowers with colorful stamens. The flower will last about a month and is said to smell like cinnamon and other spices."
    },
    "Crassula ovata" : {
      "description" : "Blooming specimens.The jade plant is an evergreen with thick branches. It has thick, shiny, smooth leaves that grow in opposing pairs along the branches. Leaves are a rich jade green, although some may appear to be more of a yellow-green. Some varieties may develop a red tinge on the edges of leaves when exposed to high levels of sunlight. New stem growth is the same colour and texture as the leaves, becoming woody and brown with age.It grows as an upright, rounded, thick-stemmed, strongly branched shrub and reaches stature heights of up to 2.5 metres. The base is usually sparsely branched. Sometimes a single main trunk of up to 6 centimetres in diameter is formed. The succulent shoots are gray-green. The bark of older branches peels off in horizontal, brownish stripes.The oppositely arranged, ascending to spreading, green leaves are stalked with up to 5 millimetres short. The fleshy, bare, obovate, wedge-shaped leaf blade is 3 to 9 centimetres long and 1.8 to 4 centimetres wide. The sharp-edged leaf margins are often reddish.Numerous varieties and cultivars have been selected, of which C. ovata 'Hummel's Sunset' has gained the Royal Horticultural Society's Award of Garden Merit.[4]"
    },
    "Senecio angulatus" : {
      "description" : ""
    },
    "Cactaceae" : {
      "description" : "Cactus Temporal range: 35–0 Ma PreꞒ Ꞓ O S D C P T J K Pg N Late Eocene - Recent Various Cactaceae Scientific classification Kingdom: Plantae Clade: Tracheophytes Clade: Angiosperms Clade: Eudicots Order: Caryophyllales Family: Cactaceae Juss.[1] Subfamilies Cactoideae Maihuenioideae Opuntioideae Pereskioideae See also Classification of the Cactaceae Synonyms[2] Opuntiaceae Desv. Leuchtenbergiaceae Salm-Dyck ex Pfeiff.Cultivated cacti in the Singapore Botanic Gardens Many species of cactus have long, sharp spines, like this Opuntia.A cactus (plural cacti, cactuses, or less commonly, cactus)[3] is a member of the plant family Cactaceae,[Note 1] a family comprising about 127 genera with some 1750 known species of the order Caryophyllales.[4] The word \"cactus\" derives, through Latin, from the Ancient Greek κάκτος, kaktos, a name originally used by Theophrastus for a spiny plant whose identity is now not certain.[5] Cacti occur in a wide range of shapes and sizes. Most cacti live in habitats subject to at least some drought. Many live in extremely dry environments, even being found in the Atacama Desert, one of the driest places on earth. Cacti show many adaptations to conserve water. Almost all cacti are succulents, meaning they have thickened, fleshy parts adapted to store water. Unlike many other succulents, the stem is the only part of most cacti where this vital process takes place. Most species of cacti have lost true leaves, retaining only spines, which are highly modified leaves. As well as defending against herbivores, spines help prevent water loss by reducing air flow close to the cactus and providing some shade. In the absence of leaves, enlarged stems carry out photosynthesis. Cacti are native to the Americas, ranging from Patagonia in the south to parts of western Canada in the north—except for Rhipsalis baccifera, which also grows in Africa and Sri Lanka.Cactus spines are produced from specialized structures called areoles, a kind of highly reduced branch. Areoles are an identifying feature of cacti. As well as spines, areoles give rise to flowers, which are usually tubular and multipetaled. Many cacti have short growing seasons and long dormancies, and are able to react quickly to any rainfall, helped by an extensive but relatively shallow root system that quickly absorbs any water reaching the ground surface. Cactus stems are often ribbed or fluted, which allows them to expand and contract easily for quick water absorption after rain, followed by long drought periods. Like other succulent plants, most cacti employ a special mechanism called \"crassulacean acid metabolism\" (CAM) as part of photosynthesis. Transpiration, during which carbon dioxide enters the plant and water escapes, does not take place during the day at the same time as photosynthesis, but instead occurs at night. The plant stores the carbon dioxide it takes in as malic acid, retaining it until daylight returns, and only then using it in photosynthesis. Because transpiration takes place during the cooler, more humid night hours, water loss is significantly reduced.Many smaller cacti have globe-shaped stems, combining the highest possible volume for water storage, with the lowest possible surface area for water loss from transpiration. The tallest[Note 2] free-standing cactus is Pachycereus pringlei, with a maximum recorded height of 19.2 m (63 ft),[6] and the smallest is Blossfeldia liliputiana, only about 1 cm (0.4 in) in diameter at maturity.[7] A fully grown saguaro (Carnegiea gigantea) is said to be able to absorb as much as 200 U.S. gallons (760 l; 170 imp gal) of water during a rainstorm.[8] A few species differ significantly in appearance from most of the family. At least superficially, plants of the genus Pereskia resemble other trees and shrubs growing around them. They have persistent leaves, and when older, bark-covered stems. Their areoles identify them as cacti, and in spite of their appearance, they, too, have many adaptations for water conservation. Pereskia is considered close to the ancestral species from which all cacti evolved. In tropical regions, other cacti grow as forest climbers and epiphytes (plants that grow on trees). Their stems are typically flattened, almost leaf-like in appearance, with fewer or even no spines, such as the well-known Christmas cactus or Thanksgiving cactus (in the genus Schlumbergera).Cacti have a variety of uses: many species are used as ornamental plants, others are grown for fodder or forage, and others for food (particularly their fruit). Cochineal is the product of an insect that lives on some cacti.Many succulent plants in both the Old and New World – such as some Euphorbiaceae (euphorbias) – bear a striking resemblance to cacti, and may incorrectly be called \"cactus\" in common usage.Contents 1 Morphology 1.1 Growth habit 1.2 Stems 1.3 Areoles 1.4 Leaves 1.5 Spines 1.6 Roots 1.7 Flowers 2 Adaptations for water conservation 2.1 Leaves and spines 2.2 Stems 2.3 Roots 2.4 Metabolism 3 Taxonomy and classification 3.1 Classification 4 Phylogeny and evolution 4.1 Phylogeny 4.2 Evolutionary history 5 Distribution 6 Reproductive ecology 7 Uses 7.1 Early history 7.2 Food 7.3 Psychoactive agents 7.4 Ornamental plants 7.5 Other uses 8 Conservation 9 Cultivation 9.1 Growing medium 9.2 Watering 9.3 Light and temperature 9.4 Propagation 9.5 Pests and diseases 10 Notes 11 References 12 Bibliography 13 External links"
    },
    "Aloe vera" : {
      "description" : "Aloe vera is a stemless or very short-stemmed plant growing to 60–100 cm (24–39 in) tall, spreading by offsets.[3] The leaves are thick and fleshy, green to grey-green, with some varieties showing white flecks on their upper and lower stem surfaces.[7] The margin of the leaf is serrated and has small white teeth. The flowers are produced in summer on a spike up to 90 cm (35 in) tall, each flower being pendulous, with a yellow tubular corolla 2–3 cm (0.8–1.2 in) long.[7][8] Like other Aloe species, Aloe vera forms arbuscular mycorrhiza, a symbiosis that allows the plant better access to mineral nutrients in soil.[9]Aloe vera leaves contain phytochemicals under study for possible bioactivity, such as acetylated mannans, polymannans, anthraquinone C-glycosides, anthrones, and other anthraquinones, such as emodin and various lectins.[10][11]"
    },
    "Echeveria" : {
      "description" : "Plants may be evergreen or deciduous. Flowers on short stalks (cymes) arise from compact rosettes of succulent fleshy, often brightly coloured leaves.[2] Species are polycarpic, meaning that they may flower and set seed many times over the course of their lifetimes. Often numerous offsets are produced, and are commonly known as \"hen and chicks\", which can also refer to other genera, such as Sempervivum, that are significantly different from Echeveria. Many species of Echeveria serve important environmental roles, such as those of host plants for butterflies. For example, the butterfly Callophrys xami uses several species of Echeveria, such as Echevelia gibbiflora, for suitable host plants. Even more, these plants are integral to the oviposition process of C. xami and some other butterfly species as well.[3][4]"
    },
    "Haworthia" : {
      "description" : "Haworthia is a large genus of small succulent plants endemic to Southern Africa (Mozambique, Namibia, Lesotho, Eswatini and South Africa).[1]Like the aloes, they are members of the subfamily Asphodeloideae and they generally resemble miniature aloes, except in their flowers, which are distinctive in appearance. They are popular garden and container plants.Contents 1 Description and characteristics 2 Distribution 3 Naming and taxonomy 3.1 Subdivisions 4 Species 5 Cultivation 6 Gallery for identification 7 References 8 External links"
    }
  },
  "Air Plants" : {
    "Tillandsia bulbosa" : {
      "description" : ""
    },
    "Tillandsia caput medusae" : {
      "description" : "In a greenhouse, the plants can bloom from spring to early summer. The red inflorescences are usually unbranched or digitate. Bright violet flowers are about 3.2 cm (1.3 in) long with the stamens exerted.[2]Tillandsia caput-medusae does not have any free water retention in its overlapping leaves because its abaxial and adaxial leaf bases provides trichomes which coats the leaves.[3] The significance of trichome is to enhance leaf permeability.[3]"
    },
    "Tillandsia ionantha" : {
      "description" : "They are acaulescent or sometimes shortly caulescent plants, with a size of 6–8 cm high. The leaves 4–9 cm long; with pods 0.6–1 cm wide, densely patent fabric; narrow triangular sheets, 0.3-0.4 cm wide, dense lepidota indument, foliaceous bracts; compound inflorescence (of simple appearance due to the reduction of the spikes to 1 flower), with 1-3 flowers, primary foliaceous bracts, much longer than the spikes, floral bracts 3 cm long, longer than the sepals and covering them in the anthesis, ecarinated, inconspicuously nervate, glabrous, membranous, sessile flowers; sepals are 2 cm long, free, the posterior carinate, the anterior ecarinated; purple petals. Capsules are 2.5-4.5 cm long.[6]Tillandsia ionantha 'Druid'"
    },
    "Tillandsia xerographica" : {
      "description" : "Tillandsia XerographicaTillandsia xerographica is a slow-growing, xerophytic epiphyte.[3] The silvery gray leaves are wide at the base and taper to a point making an attractive, sculptural rosette, 3 feet or more in diameter and over 3 feet high in flower. The inflorescence, on a thick, green stem, from 6 to 15 inches in height, densely branched. The leaf bracts are rosy red; the floral bracts are chartreuse; and the petals of the tubular flowers are red to purple and are very long lasting (months)."
    }
  },
  "Temperates" : {
    "Hedera helix" : {
      "description" : "Adult leaves and fruitStems showing the rootlets used to cling to walls and tree trunks.Hedera helix is an evergreen climbing plant, growing to 20–30 m (66–98 ft) high where suitable surfaces (trees, cliffs, walls) are available, and also growing as groundcover where no vertical surfaces occur. It climbs by means of aerial rootlets with matted pads which cling strongly to the substrate. The ability to climb on surfaces varies with the plants variety and other factors: Hedera helix prefers non-reflective, darker and rough surfaces with near-neutral pH. It generally thrives in a wide range of soil pH with 6.5 being ideal, prefers moist, shady locations and avoids exposure to direct sunlight, the latter promoting drying out in winter.[7]The leaves are alternate, 50–100 mm (2–4 in) long, with a 15–20 mm (0.6–0.8 in) petiole; they are of two types, with palmately five-lobed juvenile leaves on creeping and climbing stems, and unlobed cordate adult leaves on fertile flowering stems exposed to full sun, usually high in the crowns of trees or the top of rock faces.The flowers are produced from late summer until late autumn, individually small, in 3-to-5 cm-diameter (1.2-to-2.0 in) umbels, greenish-yellow, and very rich in nectar, an important late autumn food source for bees and other insects.The fruit are purple-black to orange-yellow berries 6–8 mm (0.2–0.3 in) in diameter, ripening in late winter,[8] and are an important food for many birds, though somewhat poisonous to humans.One to five seeds are in each berry, which are dispersed after being eaten by birds.[9][10][11]"
    },
    "Saxifraga stolonifera" : {
      "description" : "The plant spreads via threadlike stolon (runners), with plantlets taking root in the vicinity of the mother plant. It is hardy to USDA zone 5. It grows as a perennial herbaceous plant 10 to 20 cm tall, whose inflorescence bears small zygomorphous flowers that bloom during the transition between spring and summer.Like strawberry plants, it produces stolons with clones at the tip, allowing it to spread easily. It develops long thread-like extensions with scale-shaped leaves. Its petiole is 15-21 cm long. The basal leaves are green above with silver gray nerves and reddish below. The top of her hairy spit is round in outline and irregularly serrated at the edge, trimmed at the base, rounded or heart-shaped. The stem leaves are lanceolate and only 6 mm long and 2 mm wide.The flowering period is May to August. The loose, paniculate inflorescence contains 7 to 60 flowers. The sepals are protruding or struck back. Two of the five white petals are characteristically longer than the rest. The longer petals are lanceolate, 6-15 mm long and 2-4 mm wide and pointed. The smaller petals are red or yellow dotted and 2-4 mm long and 1-2 mm wide. The stamens are 4.5 mm long. The ovary is pale yellow.[3]"
    }
  }
}